### SQL Tutorial (by Michail Agladze, June 2021)

The <b>SQL</b> (Structured Query Language) was first developed in the 1970s 
<br>by IBM researchers <b>Raymond Boyce</b> and <b>Donald Chamberlin</b>. 
 - https://en.wikipedia.org/wiki/SQL 

SQL databases have become standard.
<br>There are many types and brands.
<br>This short tutorial shows how to run basic SQL commands
<br>right inside Jupyter notebook using <b>SQLite</b> - a simple free database:
- https://www.sqlite.org

You can read these pages on how to run 
<br>SQL queries from a Jupyter Notebook:
 - https://towardsdatascience.com/how-to-run-sql-queries-from-a-jupyter-notebook-aaa18e59e7bc 
 - https://stackoverflow.com/questions/50973191/connect-to-mysql-db-from-jupyter-notebook 
 - https://medium.com/@tattwei46/how-to-use-python-with-mysql-79304bee8753 

You can also search google and YouTube for SQL tutorials.
For example: - https://www.sqlcourse.com/ - good online tutorial

Also I have some tutorials on my old website:
 - https://www.levselector.com/sql_tut.html - basic SQL
 - https://www.levselector.com/sql_sybase.html - SQL for Sybase
 - https://www.levselector.com/sql_test0.html - 6 problems
 - https://www.levselector.com/sql_test1.html - 60 problems

In [1]:
import os, sys
import numpy as np
import pandas as pd

In [2]:
# this should be run only once to install "SQL" extension
# to be able to do this: %load_ext sql
#
# !pip install ipython-sql

In [3]:
%load_ext sql

In [4]:
%sql sqlite://
# %sql sqlite:////path/to/your/database.db

In [5]:
%%sql

--------------------------------------------------
-- Note: that '--' is used for comments
-- Note: each statement ends with a semicolon ";"
-- Note: we can execute more than one statement
-- Here are five empty statements
;;;;;

 * sqlite://
Done.
Done.
Done.
Done.
Done.

[]

In [6]:
%%sql
-- lets select some values by themselves

select 
  'mother' as col1, 
  'father' as col2, 
  2021     as col3;

 * sqlite://
Done.

[('mother', 'father', 2021)]

In [7]:
# The output is stored in default python variable "_"

myresult = _
display(myresult)
display(type(myresult))

[('mother', 'father', 2021)]

sql.run.ResultSet

In [8]:
#1 -- CREATE TABLE command

#We will do it in three steps (drop if exists, create, insert data)

In [9]:
%%sql
--------------------------------------------------
-- first drop table in case it exists

DROP TABLE IF EXISTS sales;

--------------------------------------------------
-- then create table fresh

CREATE TABLE sales
(
    key       varchar(6),
    ts        timestamp,
    product   integer,
    completed boolean,
    price     float
);

--------------------------------------------------
-- then insert some data into this table

INSERT INTO sales
VALUES ('sale_1', '2019-11-08 00:00', 0, TRUE, 1.1),
       ('sale_2', '2019-11-08 01:00', 0, FALSE, 1.2),
       ('sale_3', '2019-11-08 01:00', 0, TRUE, 1.3),
       ('sale_4', '2019-11-08 01:00', 1, FALSE, 1.4),
       ('sale_5', '2019-11-08 02:00', 1, TRUE, 1.5),
       ('sale_6', '2019-11-08 02:00', 1, TRUE, 1.5);

 * sqlite://
Done.
Done.
6 rows affected.

[]

In [10]:
%%sql
-- lets select all data from this table
select * from sales;

 * sqlite://
Done.

[('sale_1', '2019-11-08 00:00', 0, 1, 1.1),
 ('sale_2', '2019-11-08 01:00', 0, 0, 1.2),
 ('sale_3', '2019-11-08 01:00', 0, 1, 1.3),
 ('sale_4', '2019-11-08 01:00', 1, 0, 1.4),
 ('sale_5', '2019-11-08 02:00', 1, 1, 1.5),
 ('sale_6', '2019-11-08 02:00', 1, 1, 1.5)]

In [11]:
%%sql
-- lets select only 2 rows
select * from sales limit 2;

 * sqlite://
Done.

[('sale_1', '2019-11-08 00:00', 0, 1, 1.1),
 ('sale_2', '2019-11-08 01:00', 0, 0, 1.2)]

In [12]:
# lets put the result into a Pandas DataFrame
result = _
df = result.DataFrame()
df

      key                ts  product  completed  price
0  sale_1  2019-11-08 00:00        0          1    1.1
1  sale_2  2019-11-08 01:00        0          0    1.2

In [13]:
#2 -- ALTER TABLE command - RENAME TO

In [14]:
%%sql
ALTER TABLE sales
RENAME TO salesNew;

 * sqlite://
Done.

[]

In [15]:
%%sql
select * from salesNew;

 * sqlite://
Done.

[('sale_1', '2019-11-08 00:00', 0, 1, 1.1),
 ('sale_2', '2019-11-08 01:00', 0, 0, 1.2),
 ('sale_3', '2019-11-08 01:00', 0, 1, 1.3),
 ('sale_4', '2019-11-08 01:00', 1, 0, 1.4),
 ('sale_5', '2019-11-08 02:00', 1, 1, 1.5),
 ('sale_6', '2019-11-08 02:00', 1, 1, 1.5)]

In [16]:
#3 -- ALTER command -- RENAME COLUMN

In [17]:
%%sql
ALTER TABLE salesNew
RENAME COLUMN key 
TO keyNew;

 * sqlite://
Done.

[]

In [18]:
%%sql
select * from salesNew;

 * sqlite://
Done.

[('sale_1', '2019-11-08 00:00', 0, 1, 1.1),
 ('sale_2', '2019-11-08 01:00', 0, 0, 1.2),
 ('sale_3', '2019-11-08 01:00', 0, 1, 1.3),
 ('sale_4', '2019-11-08 01:00', 1, 0, 1.4),
 ('sale_5', '2019-11-08 02:00', 1, 1, 1.5),
 ('sale_6', '2019-11-08 02:00', 1, 1, 1.5)]

In [19]:
#4 -- ALTER command -- ADD COLUMN

In [20]:
%%sql
ALTER TABLE salesNew
ADD COLUMN newCol
Default (10);

 * sqlite://
Done.

[]

In [21]:
%%sql
select * from salesNew;

 * sqlite://
Done.

[('sale_1', '2019-11-08 00:00', 0, 1, 1.1, 10),
 ('sale_2', '2019-11-08 01:00', 0, 0, 1.2, 10),
 ('sale_3', '2019-11-08 01:00', 0, 1, 1.3, 10),
 ('sale_4', '2019-11-08 01:00', 1, 0, 1.4, 10),
 ('sale_5', '2019-11-08 02:00', 1, 1, 1.5, 10),
 ('sale_6', '2019-11-08 02:00', 1, 1, 1.5, 10)]

In [22]:
#5 -- UPDATE  COMMAND -- insert value into an existing column

In [23]:
%%sql
UPDATE salesNew 
    set newCol = 333 
    WHERE keyNew = 'sale_3';

 * sqlite://
1 rows affected.

[]

In [24]:
%%sql
select * from salesNew;

 * sqlite://
Done.

[('sale_1', '2019-11-08 00:00', 0, 1, 1.1, 10),
 ('sale_2', '2019-11-08 01:00', 0, 0, 1.2, 10),
 ('sale_3', '2019-11-08 01:00', 0, 1, 1.3, 333),
 ('sale_4', '2019-11-08 01:00', 1, 0, 1.4, 10),
 ('sale_5', '2019-11-08 02:00', 1, 1, 1.5, 10),
 ('sale_6', '2019-11-08 02:00', 1, 1, 1.5, 10)]

In [25]:
#6 -- INSERT INTO command -- add values into new column

In [26]:
%%sql
INSERT INTO 
    salesNew (newCol)
VALUES (111);

 * sqlite://
1 rows affected.

[]

In [27]:
%%sql
select * from salesNew;

 * sqlite://
Done.

[('sale_1', '2019-11-08 00:00', 0, 1, 1.1, 10),
 ('sale_2', '2019-11-08 01:00', 0, 0, 1.2, 10),
 ('sale_3', '2019-11-08 01:00', 0, 1, 1.3, 333),
 ('sale_4', '2019-11-08 01:00', 1, 0, 1.4, 10),
 ('sale_5', '2019-11-08 02:00', 1, 1, 1.5, 10),
 ('sale_6', '2019-11-08 02:00', 1, 1, 1.5, 10),
 (None, None, None, None, None, 111)]

In [28]:
%%sql
ALTER TABLE salesNew
ADD COLUMN newCol2
    Default (55);

 * sqlite://
Done.

[]

In [29]:
%%sql
select * from salesNew;

 * sqlite://
Done.

[('sale_1', '2019-11-08 00:00', 0, 1, 1.1, 10, 55),
 ('sale_2', '2019-11-08 01:00', 0, 0, 1.2, 10, 55),
 ('sale_3', '2019-11-08 01:00', 0, 1, 1.3, 333, 55),
 ('sale_4', '2019-11-08 01:00', 1, 0, 1.4, 10, 55),
 ('sale_5', '2019-11-08 02:00', 1, 1, 1.5, 10, 55),
 ('sale_6', '2019-11-08 02:00', 1, 1, 1.5, 10, 55),
 (None, None, None, None, None, 111, 55)]

In [30]:
#7 -- DROP COLUMN -- get rid of a colum in the table

In [31]:
%%sql
CREATE TABLE salesNewTemp
(
    keyNew    varchar(6),
    ts        timestamp,
    product   integer,
    completed boolean,
    price     float,
    newCol    integer
);

 * sqlite://
Done.

[]

In [32]:
%%sql
INSERT INTO 
    salesNewTemp
SELECT 
    keyNew, 
    ts, 
    product, 
    completed, 
    price, 
    newCol 
FROM 
    salesNew;

select * from salesNewTemp;

 * sqlite://
7 rows affected.
Done.

[('sale_1', '2019-11-08 00:00', 0, 1, 1.1, 10),
 ('sale_2', '2019-11-08 01:00', 0, 0, 1.2, 10),
 ('sale_3', '2019-11-08 01:00', 0, 1, 1.3, 333),
 ('sale_4', '2019-11-08 01:00', 1, 0, 1.4, 10),
 ('sale_5', '2019-11-08 02:00', 1, 1, 1.5, 10),
 ('sale_6', '2019-11-08 02:00', 1, 1, 1.5, 10),
 (None, None, None, None, None, 111)]

In [33]:
%%sql
DROP TABLE IF EXISTS 
    salesNew;
    
ALTER TABLE 
    salesNewTemp
RENAME TO 
    salesNew;

select * from salesNew;

 * sqlite://
Done.
Done.
Done.

[('sale_1', '2019-11-08 00:00', 0, 1, 1.1, 10),
 ('sale_2', '2019-11-08 01:00', 0, 0, 1.2, 10),
 ('sale_3', '2019-11-08 01:00', 0, 1, 1.3, 333),
 ('sale_4', '2019-11-08 01:00', 1, 0, 1.4, 10),
 ('sale_5', '2019-11-08 02:00', 1, 1, 1.5, 10),
 ('sale_6', '2019-11-08 02:00', 1, 1, 1.5, 10),
 (None, None, None, None, None, 111)]

In [34]:
#8 -- DELETE command -- delete a row

In [35]:
%%sql
DELETE FROM 
    salesNew
WHERE 
    newCol = 111;
    
DELETE FROM 
    salesNew
WHERE 
    newCol = 777;

select * from salesNew;

 * sqlite://
1 rows affected.
0 rows affected.
Done.

[('sale_1', '2019-11-08 00:00', 0, 1, 1.1, 10),
 ('sale_2', '2019-11-08 01:00', 0, 0, 1.2, 10),
 ('sale_3', '2019-11-08 01:00', 0, 1, 1.3, 333),
 ('sale_4', '2019-11-08 01:00', 1, 0, 1.4, 10),
 ('sale_5', '2019-11-08 02:00', 1, 1, 1.5, 10),
 ('sale_6', '2019-11-08 02:00', 1, 1, 1.5, 10)]

In [36]:
#9 -- DELETE command -- delete a row with any NULL values

In [37]:
%%sql
INSERT INTO 
    salesNew (newCol)
VALUES 
    (777);

select * from salesNew;

 * sqlite://
1 rows affected.
Done.

[('sale_1', '2019-11-08 00:00', 0, 1, 1.1, 10),
 ('sale_2', '2019-11-08 01:00', 0, 0, 1.2, 10),
 ('sale_3', '2019-11-08 01:00', 0, 1, 1.3, 333),
 ('sale_4', '2019-11-08 01:00', 1, 0, 1.4, 10),
 ('sale_5', '2019-11-08 02:00', 1, 1, 1.5, 10),
 ('sale_6', '2019-11-08 02:00', 1, 1, 1.5, 10),
 (None, None, None, None, None, 777)]

In [38]:
%%sql
DELETE FROM salesNew
WHERE 
    keyNew IS NULL OR 
    ts IS NULL OR 
    product IS NULL OR 
    completed IS NULL OR 
    price IS NULL OR 
    newCol IS NULL;

select * from salesNew;

 * sqlite://
1 rows affected.
Done.

[('sale_1', '2019-11-08 00:00', 0, 1, 1.1, 10),
 ('sale_2', '2019-11-08 01:00', 0, 0, 1.2, 10),
 ('sale_3', '2019-11-08 01:00', 0, 1, 1.3, 333),
 ('sale_4', '2019-11-08 01:00', 1, 0, 1.4, 10),
 ('sale_5', '2019-11-08 02:00', 1, 1, 1.5, 10),
 ('sale_6', '2019-11-08 02:00', 1, 1, 1.5, 10)]

In [39]:
#10 -- DROP TABLE command -- this will get rid of that table

In [40]:
%%sql
CREATE TABLE salesNewExample
(
    key       varchar(6),
    ts        timestamp,
    product   integer,
    completed boolean,
    price     float
);

INSERT INTO 
    salesNewExample
VALUES 
    ('example','7/7/7', 7, 3.3, 444);

select * from salesNewExample;

 * sqlite://
Done.
1 rows affected.
Done.

[('example', '7/7/7', 7, 3.3, 444.0)]

In [41]:
%%sql
DROP TABLE 
    salesNewExample;

select * from salesNewExample;

 * sqlite://
Done.
(sqlite3.OperationalError) no such table: salesNewExample
[SQL: select * from salesNewExample;]
(Background on this error at: https://sqlalche.me/e/20/e3q8)

In [42]:
#11 -- SELECT command -- show a specific column from the table

In [43]:
%%sql
SELECT 
    price,
    product,
    completed
FROM 
    salesNew;

 * sqlite://
Done.

[(1.1, 0, 1), (1.2, 0, 0), (1.3, 0, 1), (1.4, 1, 0), (1.5, 1, 1), (1.5, 1, 1)]

In [44]:
#we have already seen how SELECT * will show the whole table

In [45]:
%%sql
select * FROM salesNew;

 * sqlite://
Done.

[('sale_1', '2019-11-08 00:00', 0, 1, 1.1, 10),
 ('sale_2', '2019-11-08 01:00', 0, 0, 1.2, 10),
 ('sale_3', '2019-11-08 01:00', 0, 1, 1.3, 333),
 ('sale_4', '2019-11-08 01:00', 1, 0, 1.4, 10),
 ('sale_5', '2019-11-08 02:00', 1, 1, 1.5, 10),
 ('sale_6', '2019-11-08 02:00', 1, 1, 1.5, 10)]

In [46]:
# CREATE TABLE AS -- make a table from a search query

#this will create a table called keyNewPrice with just columns keyNew and price... we made our query into a table

In [47]:
%%sql
CREATE TABLE keyNewPrice AS
SELECT
    keyNew,
    price
FROM
    salesNew;

 * sqlite://
Done.

[]

In [48]:
%%sql

SELECT * FROM keyNewPrice;

 * sqlite://
Done.

[('sale_1', 1.1),
 ('sale_2', 1.2),
 ('sale_3', 1.3),
 ('sale_4', 1.4),
 ('sale_5', 1.5),
 ('sale_6', 1.5)]

In [49]:
#JOIN commands

In [50]:
#12 -- CROSS JOIN -- matching every row of the first table with every row of the second table -- creates LARGE table

In [51]:
%%sql
CREATE TABLE soldRecords
(
    keyNewRecords       varchar(6),
    numberSold   integer
);

INSERT INTO 
    soldRecords
VALUES 
    ('sale_1', 11),
    ('sale_22', 22),
    ('sale_3', 33),
    ('sale_44', 44),
    ('sale_5', 55),
    ('sale_66', 66);

 * sqlite://
Done.
6 rows affected.

[]

In [52]:
%%sql
SELECT 
    keyNew, 
    ts, 
    price 
FROM 
    salesNew 
    
CROSS JOIN 
    soldRecords;

 * sqlite://
Done.

[('sale_1', '2019-11-08 00:00', 1.1),
 ('sale_1', '2019-11-08 00:00', 1.1),
 ('sale_1', '2019-11-08 00:00', 1.1),
 ('sale_1', '2019-11-08 00:00', 1.1),
 ('sale_1', '2019-11-08 00:00', 1.1),
 ('sale_1', '2019-11-08 00:00', 1.1),
 ('sale_2', '2019-11-08 01:00', 1.2),
 ('sale_2', '2019-11-08 01:00', 1.2),
 ('sale_2', '2019-11-08 01:00', 1.2),
 ('sale_2', '2019-11-08 01:00', 1.2),
 ('sale_2', '2019-11-08 01:00', 1.2),
 ('sale_2', '2019-11-08 01:00', 1.2),
 ('sale_3', '2019-11-08 01:00', 1.3),
 ('sale_3', '2019-11-08 01:00', 1.3),
 ('sale_3', '2019-11-08 01:00', 1.3),
 ('sale_3', '2019-11-08 01:00', 1.3),
 ('sale_3', '2019-11-08 01:00', 1.3),
 ('sale_3', '2019-11-08 01:00', 1.3),
 ('sale_4', '2019-11-08 01:00', 1.4),
 ('sale_4', '2019-11-08 01:00', 1.4),
 ('sale_4', '2019-11-08 01:00', 1.4),
 ('sale_4', '2019-11-08 01:00', 1.4),
 ('sale_4', '2019-11-08 01:00', 1.4),
 ('sale_4', '2019-11-08 01:00', 1.4),
 ('sale_5', '2019-11-08 02:00', 1.5),
 ('sale_5', '2019-11-08 02:00', 1.5),
 ('sale_5', '2019-11-08 02:00', 1.5),
 ('sale_5', '2019-11-08 02:00', 1.5),
 ('sale_5', '2019-11-08 02:00', 1.5),
 ('sale_5', '2019-11-08 02:00', 1.5),
 ('sale_6', '2019-11-08 02:00', 1.5),
 ('sale_6', '2019-11-08 02:00', 1.5),
 ('sale_6', '2019-11-08 02:00', 1.5),
 ('sale_6', '2019-11-08 02:00', 1.5),
 ('sale_6', '2019-11-08 02:00', 1.5),
 ('sale_6', '2019-11-08 02:00', 1.5)]

In [53]:
#13 -- INNER JOIN -- identify common entries in two tables based on condition

In [54]:
%%sql
SELECT 
    keyNew, 
    ts, 
    price 
FROM 
    salesNew sn
INNER JOIN soldRecords sr
    ON sn.keyNew = sr.keyNewRecords;

 * sqlite://
Done.

[('sale_1', '2019-11-08 00:00', 1.1),
 ('sale_3', '2019-11-08 01:00', 1.3),
 ('sale_5', '2019-11-08 02:00', 1.5)]

In [55]:
#14 -- LEFT OUTER JOIN -- Return all rows from the left-hand table and only the rows from the right that fit the 
#specified condition

In [56]:
%%sql
SELECT 
    keyNew, 
    ts, 
    price 
FROM 
    salesNew sn
LEFT OUTER JOIN 
    soldRecords sr
    ON 
    sn.keyNew = sr.keyNewRecords;

 * sqlite://
Done.

[('sale_1', '2019-11-08 00:00', 1.1),
 ('sale_2', '2019-11-08 01:00', 1.2),
 ('sale_3', '2019-11-08 01:00', 1.3),
 ('sale_4', '2019-11-08 01:00', 1.4),
 ('sale_5', '2019-11-08 02:00', 1.5),
 ('sale_6', '2019-11-08 02:00', 1.5)]

In [57]:
%%sql
select * FROM salesNew;

 * sqlite://
Done.

[('sale_1', '2019-11-08 00:00', 0, 1, 1.1, 10),
 ('sale_2', '2019-11-08 01:00', 0, 0, 1.2, 10),
 ('sale_3', '2019-11-08 01:00', 0, 1, 1.3, 333),
 ('sale_4', '2019-11-08 01:00', 1, 0, 1.4, 10),
 ('sale_5', '2019-11-08 02:00', 1, 1, 1.5, 10),
 ('sale_6', '2019-11-08 02:00', 1, 1, 1.5, 10)]

In [58]:
%%sql
select * FROM soldRecords;

 * sqlite://
Done.

[('sale_1', 11),
 ('sale_22', 22),
 ('sale_3', 33),
 ('sale_44', 44),
 ('sale_5', 55),
 ('sale_66', 66)]

In [59]:
#%%sql
#DROP TABLE soldRecords;

In [60]:
#%%sql
#DROP TABLE salesNew;

In [61]:
#15 -- WHERE command -- getting a set of results based on a condition we set for the table contents

In [62]:
%%sql
SELECT * FROM salesNew 
WHERE 
    newCol > 10;

 * sqlite://
Done.

[('sale_3', '2019-11-08 01:00', 0, 1, 1.3, 333)]

In [63]:
# 16 -- WHERE command cont'd -- adding more than one constraint -- OR statement

In [64]:
%%sql
SELECT * FROM salesNew 
WHERE 
    newCol > 10 
OR 
    price >= 1.3;

 * sqlite://
Done.

[('sale_3', '2019-11-08 01:00', 0, 1, 1.3, 333),
 ('sale_4', '2019-11-08 01:00', 1, 0, 1.4, 10),
 ('sale_5', '2019-11-08 02:00', 1, 1, 1.5, 10),
 ('sale_6', '2019-11-08 02:00', 1, 1, 1.5, 10)]

In [65]:
#17 -- WHERE command cont'd -- adding more than one contstraint using WHERE -- AND statement

In [66]:
%%sql
SELECT * FROM salesNew 
WHERE 
    product = 1 
AND 
    price = 1.5;

 * sqlite://
Done.

[('sale_5', '2019-11-08 02:00', 1, 1, 1.5, 10),
 ('sale_6', '2019-11-08 02:00', 1, 1, 1.5, 10)]

In [67]:
%%sql
SELECT ts FROM salesNew 
WHERE 
    completed = 1 
AND 
    newCol > 10;

 * sqlite://
Done.

[('2019-11-08 01:00',)]

In [68]:
#18 -- WHERE command cont'd -- isolating contents of a column based on specific value in another column

In [69]:
%%sql
SELECT 
    ts 
FROM 
    salesNew 
WHERE 
    completed = 1;

 * sqlite://
Done.

[('2019-11-08 00:00',),
 ('2019-11-08 01:00',),
 ('2019-11-08 02:00',),
 ('2019-11-08 02:00',)]

In [70]:
#19 -- GROUP BY command -- connected to the SELECT statement, this command allows you to arrange identical data
#into groups with the help of some functions -- one row is returned for each "group"

In [71]:
#return unique entries in our table specific to completed and newCol

In [72]:
%%sql
SELECT * FROM salesNew
GROUP BY 
    completed, 
    newCol;

 * sqlite://
Done.

[('sale_2', '2019-11-08 01:00', 0, 0, 1.2, 10),
 ('sale_1', '2019-11-08 00:00', 0, 1, 1.1, 10),
 ('sale_3', '2019-11-08 01:00', 0, 1, 1.3, 333)]

In [73]:
#20 -- GROUP BY command cont'd -- return count of price at different timestamps 
#(how many timestamps reflect the same price)

In [74]:
%%sql
SELECT 
    price, 
    COUNT(ts) 
FROM 
    salesNew
GROUP BY 
    price;

 * sqlite://
Done.

[(1.1, 1), (1.2, 1), (1.3, 1), (1.4, 1), (1.5, 2)]

In [75]:
#21 -- GROUP BY command cont'd -- return the above result in decreasing order of count (so from most to least)

In [76]:
%%sql
SELECT 
    price, 
    COUNT(ts) 
FROM 
    salesNew
GROUP BY 
    price
ORDER BY 
    COUNT(ts) DESC;

 * sqlite://
Done.

[(1.5, 2), (1.4, 1), (1.3, 1), (1.2, 1), (1.1, 1)]

In [77]:
#22 -- GROUP BY command cont'd -- SUM function -- return SUM of completed rows for specific timestamps in our table,
#this gives us a summary of how many completed at that timestamp.

In [78]:
%%sql
SELECT 
    ts, 
    SUM(completed) 
FROM 
    salesNew
GROUP BY 
    ts;

 * sqlite://
Done.

[('2019-11-08 00:00', 1), ('2019-11-08 01:00', 1), ('2019-11-08 02:00', 2)]

In [79]:
%%sql
SELECT * FROM salesNew;

 * sqlite://
Done.

[('sale_1', '2019-11-08 00:00', 0, 1, 1.1, 10),
 ('sale_2', '2019-11-08 01:00', 0, 0, 1.2, 10),
 ('sale_3', '2019-11-08 01:00', 0, 1, 1.3, 333),
 ('sale_4', '2019-11-08 01:00', 1, 0, 1.4, 10),
 ('sale_5', '2019-11-08 02:00', 1, 1, 1.5, 10),
 ('sale_6', '2019-11-08 02:00', 1, 1, 1.5, 10)]

In [80]:
%%sql
SELECT * FROM soldRecords;

 * sqlite://
Done.

[('sale_1', 11),
 ('sale_22', 22),
 ('sale_3', 33),
 ('sale_44', 44),
 ('sale_5', 55),
 ('sale_66', 66)]

In [81]:
#23 -- GROUP BY command cont'd -- GROUBY BY with INNER JOIN -- Bring in info from soldRecords table that connects
#to info in salesNew table, and display result of connection

#our example will yield numberSold column entries that correspond to matching "key" values in both tables

In [82]:
%%sql
SELECT 
    keyNew, 
    soldRecords.numberSold
FROM 
    salesNew
INNER JOIN 
    soldRecords
ON 
    salesNew.keyNew = soldRecords.keyNewRecords
GROUP BY 
    keyNew;

 * sqlite://
Done.

[('sale_1', 11), ('sale_3', 33), ('sale_5', 55)]

In [83]:
#24 -- GROUP BY command cont'd -- using the HAVING clause -- we further filter our data by adding another constraint

#in our example we will find of the above numberSold search, which entry has newCol (salesNew table) entry that is 
#greater than 10

In [84]:
%%sql
SELECT 
    keyNew, 
    soldRecords.numberSold
FROM 
    salesNew
INNER JOIN 
    soldRecords ON salesNew.keyNew = soldRecords.keyNewRecords
GROUP BY 
    keyNew
HAVING 
    newCol > 10;

 * sqlite://
Done.

[('sale_3', 33)]

In [85]:
#25 -- GROUP BY command cont'd -- using the HAVING clause -- now newCol less than or equal to 10

In [86]:
%%sql
SELECT 
    keyNew, 
    soldRecords.numberSold
FROM 
    salesNew
INNER JOIN 
    soldRecords 
ON 
    salesNew.keyNew = soldRecords.keyNewRecords
GROUP BY 
    keyNew
HAVING 
    newCol <= 10;

 * sqlite://
Done.

[('sale_1', 11), ('sale_5', 55)]

In [87]:
#24 -- GROUP BY command cont'd -- MAX, MIN, and AVG functions

In [88]:
%%sql
SELECT 
    keyNew, 
    completed, 
    min(price), 
    max(price), 
    round(avg(price),2)
FROM 
    salesNew
GROUP BY 
    completed;

 * sqlite://
Done.

[('sale_4', 0, 1.2, 1.4, 1.3), ('sale_5', 1, 1.1, 1.5, 1.35)]

In [89]:
#25 -- GROUP BY command cont'd -- MAX, MIN, and AVG functions with LEFT JOIN to soldRecords table

#notice how numberSold is None, because in the tables there is no matching keys for numberSold with 0 completed

In [90]:
%%sql
SELECT 
    keyNew, 
    completed, 
    min(price), 
    max(price), 
    round(avg(price),2), 
    soldRecords.numberSold
FROM 
    salesNew
LEFT JOIN 
    soldRecords 
ON 
    salesNew.keyNew = soldRecords.keyNewRecords
GROUP BY 
    completed;

 * sqlite://
Done.

[('sale_4', 0, 1.2, 1.4, 1.3, None), ('sale_5', 1, 1.1, 1.5, 1.35, 55)]

In [91]:
#26 -- GROUP BY command cont'd -- GROUP BY using multiple columns

#in our example we sort by completed and then by product

In [92]:
%%sql
SELECT 
    keyNew, 
    completed, 
    product, 
    price
FROM 
    salesNew
GROUP BY 
    completed, 
    product;

 * sqlite://
Done.

[('sale_2', 0, 0, 1.2),
 ('sale_4', 0, 1, 1.4),
 ('sale_1', 1, 0, 1.1),
 ('sale_5', 1, 1, 1.5)]

In [93]:
#26 -- ORDER BY command -- arrange query results in the order desired

#in our example we look for completed and top price first

In [94]:
%%sql
SELECT * FROM salesNew
ORDER BY 
    completed DESC, 
    price DESC;

 * sqlite://
Done.

[('sale_5', '2019-11-08 02:00', 1, 1, 1.5, 10),
 ('sale_6', '2019-11-08 02:00', 1, 1, 1.5, 10),
 ('sale_3', '2019-11-08 01:00', 0, 1, 1.3, 333),
 ('sale_1', '2019-11-08 00:00', 0, 1, 1.1, 10),
 ('sale_4', '2019-11-08 01:00', 1, 0, 1.4, 10),
 ('sale_2', '2019-11-08 01:00', 0, 0, 1.2, 10)]

In [95]:
#27 -- ORDER BY command -- use ascending order (ASC) for the same search

#this time not completed and lowest price first

In [96]:
%%sql
SELECT * FROM salesNew
ORDER BY 
    completed ASC, 
    price ASC;

 * sqlite://
Done.

[('sale_2', '2019-11-08 01:00', 0, 0, 1.2, 10),
 ('sale_4', '2019-11-08 01:00', 1, 0, 1.4, 10),
 ('sale_1', '2019-11-08 00:00', 0, 1, 1.1, 10),
 ('sale_3', '2019-11-08 01:00', 0, 1, 1.3, 333),
 ('sale_5', '2019-11-08 02:00', 1, 1, 1.5, 10),
 ('sale_6', '2019-11-08 02:00', 1, 1, 1.5, 10)]

In [97]:
#28 -- ORDER BY command -- isolate search to a few columns, not the whole table

In [98]:
%%sql
SELECT 
    ts, 
    product, 
    price 
FROM 
    salesNew
ORDER BY 
    price DESC;

 * sqlite://
Done.

[('2019-11-08 02:00', 1, 1.5),
 ('2019-11-08 02:00', 1, 1.5),
 ('2019-11-08 01:00', 1, 1.4),
 ('2019-11-08 01:00', 0, 1.3),
 ('2019-11-08 01:00', 0, 1.2),
 ('2019-11-08 00:00', 0, 1.1)]

In [99]:
#29 -- ORDER BY command -- string column in descending order

In [100]:
%%sql
SELECT 
    keyNew, 
    product, 
    price 
FROM 
    salesNew
ORDER BY 
    keyNew DESC;

 * sqlite://
Done.

[('sale_6', 1, 1.5),
 ('sale_5', 1, 1.5),
 ('sale_4', 1, 1.4),
 ('sale_3', 0, 1.3),
 ('sale_2', 0, 1.2),
 ('sale_1', 0, 1.1)]

In [101]:
#30 -- UNION command -- join two queries (removing duplicates)

In [102]:
%%sql
SELECT 
    keyNew 
FROM 
    salesNew
    
UNION

SELECT 
    keyNewRecords 
FROM 
    soldRecords;

 * sqlite://
Done.

[('sale_1',),
 ('sale_2',),
 ('sale_22',),
 ('sale_3',),
 ('sale_4',),
 ('sale_44',),
 ('sale_5',),
 ('sale_6',),
 ('sale_66',)]

In [103]:
#31 -- UNION ALL command -- join two queries (do not remove duplicates)

In [104]:
%%sql
SELECT 
    keyNew 
FROM 
    salesNew
    
UNION ALL

SELECT 
    keyNewRecords 
FROM 
    soldRecords
ORDER BY 
    keyNew ASC;

 * sqlite://
Done.

[('sale_1',),
 ('sale_1',),
 ('sale_2',),
 ('sale_22',),
 ('sale_3',),
 ('sale_3',),
 ('sale_4',),
 ('sale_44',),
 ('sale_5',),
 ('sale_5',),
 ('sale_6',),
 ('sale_66',)]

In [105]:
#32 -- IS NULL command -- checking for NULL values

#our example below returns the row(s) that contain a NULL value in the specified column

In [106]:
%%sql
INSERT INTO 
    salesNew (newCol)
VALUES 
    (777);

select * from salesNew;

 * sqlite://
1 rows affected.
Done.

[('sale_1', '2019-11-08 00:00', 0, 1, 1.1, 10),
 ('sale_2', '2019-11-08 01:00', 0, 0, 1.2, 10),
 ('sale_3', '2019-11-08 01:00', 0, 1, 1.3, 333),
 ('sale_4', '2019-11-08 01:00', 1, 0, 1.4, 10),
 ('sale_5', '2019-11-08 02:00', 1, 1, 1.5, 10),
 ('sale_6', '2019-11-08 02:00', 1, 1, 1.5, 10),
 (None, None, None, None, None, 777)]

In [107]:
%%sql
SELECT * FROM salesNew
WHERE 
    keyNew IS NULL;

 * sqlite://
Done.

[(None, None, None, None, None, 777)]

In [108]:
#33 -- IS NOT NULL command -- checking for NULL values

#our example below returns the row(s) that DON'T contain a NULL value in the specified column

In [109]:
%%sql
SELECT * FROM salesNew
WHERE 
    keyNew IS NOT NULL;

 * sqlite://
Done.

[('sale_1', '2019-11-08 00:00', 0, 1, 1.1, 10),
 ('sale_2', '2019-11-08 01:00', 0, 0, 1.2, 10),
 ('sale_3', '2019-11-08 01:00', 0, 1, 1.3, 333),
 ('sale_4', '2019-11-08 01:00', 1, 0, 1.4, 10),
 ('sale_5', '2019-11-08 02:00', 1, 1, 1.5, 10),
 ('sale_6', '2019-11-08 02:00', 1, 1, 1.5, 10)]

In [110]:
#34 -- IN command -- use this to see if any value in your query matches a value you specify

#in our example we isolate rows where newCol = 333 or 777

In [111]:
%%sql
SELECT 
    product, 
    completed, 
    ts, 
    newCol 
FROM 
    salesNew
WHERE 
    newCol IN (333, 777)
ORDER BY 
    newCol DESC;

 * sqlite://
Done.

[(None, None, None, 777), (0, 1, '2019-11-08 01:00', 333)]

In [112]:
#35 -- OR command -- same result as IN, but different syntax

In [113]:
%%sql
SELECT 
    product, 
    completed, 
    ts, 
    newCol 
FROM 
    salesNew
WHERE 
    newCol = 333 
OR 
    newCol = 777
ORDER BY 
    newCol DESC;

 * sqlite://
Done.

[(None, None, None, 777), (0, 1, '2019-11-08 01:00', 333)]

In [114]:
#36 -- NOT IN command  -- opposite result of IN
#use this to see if any value in your query DOES NOT matches a value you specify

In [115]:
%%sql
SELECT 
    product, 
    completed, 
    ts, 
    newCol 
FROM 
    salesNew
WHERE 
    newCol NOT IN (333, 777)
ORDER BY 
    newCol DESC;

 * sqlite://
Done.

[(0, 1, '2019-11-08 00:00', 10),
 (0, 0, '2019-11-08 01:00', 10),
 (1, 0, '2019-11-08 01:00', 10),
 (1, 1, '2019-11-08 02:00', 10),
 (1, 1, '2019-11-08 02:00', 10)]

In [116]:
#37 -- SUBQUERY -- a SELECT statment nested in another SELECT statement

#In our example we isolate matching keys from the saleNew and soldRecords tables.

In [117]:
%%sql
SELECT 
    keyNew, 
    product, 
    price 
FROM 
    salesNew sn
WHERE keyNew = 
    (
        SELECT 
            keyNewRecords
        FROM 
            soldRecords sr
        WHERE 
            sn.keyNew = sr.keyNewRecords 
    );

 * sqlite://
Done.

[('sale_1', 0, 1.1), ('sale_3', 0, 1.3), ('sale_5', 1, 1.5)]

In [118]:
#38 -- SUBQUERY cont'd -- more specific condition

In [119]:
%%sql
SELECT 
    keyNew, 
    product, 
    price 
FROM 
    salesNew
WHERE 
    keyNew = 
    (
        SELECT 
            keyNewRecords
        FROM 
            soldRecords
        WHERE 
            keyNewRecords = "sale_5" 
    );

 * sqlite://
Done.

[('sale_5', 1, 1.5)]

In [120]:
#39 -- CASE expression -- allows us to create an IF-THEN-ELSE condition in our query, dividing results accordingly

#notice how in our example, we created a classification ProductType, and classified any newCol entry that equals 10
#as generic, and anything else as unique

In [121]:
%%sql
SELECT 
    newCol, 
    price, 
    product,
    CASE 
        newCol 
            WHEN 10
                THEN "Generic"
            ELSE "Unique"
    END ProductType
FROM 
    salesNew
ORDER BY 
    keyNew;

 * sqlite://
Done.

[(777, None, None, 'Unique'),
 (10, 1.1, 0, 'Generic'),
 (10, 1.2, 0, 'Generic'),
 (333, 1.3, 0, 'Unique'),
 (10, 1.4, 1, 'Generic'),
 (10, 1.5, 1, 'Generic'),
 (10, 1.5, 1, 'Generic')]

In [122]:
#40 -- CASE expression -- using case to search our results according to a specified filter and categorize
#query accordingly

In [123]:
%%sql
SELECT 
    keyNew, 
    price, 
    completed,
    CASE 
        WHEN completed = 1 
            THEN "Sold"
        WHEN newCol != 10 
            THEN "Beta Testing"
        ELSE "Not Sold"
    END currentStatus
FROM 
    salesNew;

 * sqlite://
Done.

[('sale_1', 1.1, 1, 'Sold'),
 ('sale_2', 1.2, 0, 'Not Sold'),
 ('sale_3', 1.3, 1, 'Sold'),
 ('sale_4', 1.4, 0, 'Not Sold'),
 ('sale_5', 1.5, 1, 'Sold'),
 ('sale_6', 1.5, 1, 'Sold'),
 (None, None, None, 'Beta Testing')]

In [124]:
#41 -- WITH clause -- creating a labeled subquery that we can refer to throughout our query

In [125]:
%%sql
WITH 
    keyOne 
AS 
    (
        SELECT
            keyNew
        FROM 
            salesNew
    )
    
SELECT * FROM keyOne;

 * sqlite://
Done.

[('sale_1',),
 ('sale_2',),
 ('sale_3',),
 ('sale_4',),
 ('sale_5',),
 ('sale_6',),
 (None,)]

In [126]:
%%sql 
WITH
    keyTwo
AS
    (
        SELECT
            keyNewRecords
        FROM
            soldRecords
    )
    
SELECT * FROM keyTwo;

 * sqlite://
Done.

[('sale_1',),
 ('sale_22',),
 ('sale_3',),
 ('sale_44',),
 ('sale_5',),
 ('sale_66',)]

In [127]:
#42 -- WITH clause -- subquery example where we create a subquery that calls on the common entries of two tables based
#on one column

#extending our example, we then use the query we created through the WITH clause to further narrow our search of
#those results

In [128]:
%%sql
WITH 
    sNew_sRecords
AS
    (
        SELECT * FROM salesNew sn
        WHERE keyNew = 
        (
            SELECT 
                keyNewRecords
            FROM 
                soldRecords sr
            WHERE 
                sn.keyNew = sr.keyNewRecords 
        )
    
    )


SELECT 
    keyNew, 
    completed, 
    min(price)
FROM
    sNew_sRecords;

 * sqlite://
Done.

[('sale_1', 1, 1.1)]

In [129]:
#43 -- Window Functions -- ROW_NUMBER() -- adds sequential integer to each row in our query result

In [130]:
%%sql
SELECT 
    ROW_NUMBER()
        OVER (
            ORDER BY keyNew
             ) RowCount,
    keyNew,
    ts,
    price,
    completed
FROM
    salesNew;

 * sqlite://
Done.

[(1, None, None, None, None),
 (2, 'sale_1', '2019-11-08 00:00', 1.1, 1),
 (3, 'sale_2', '2019-11-08 01:00', 1.2, 0),
 (4, 'sale_3', '2019-11-08 01:00', 1.3, 1),
 (5, 'sale_4', '2019-11-08 01:00', 1.4, 0),
 (6, 'sale_5', '2019-11-08 02:00', 1.5, 1),
 (7, 'sale_6', '2019-11-08 02:00', 1.5, 1)]

In [131]:
#44 -- Window Functions -- ROW_NUMBER() cont'd -- setting the order of the query it more specifically

#NOTE: we are interested in what is completed first, and which was highest price, 
#so we sort by descending order in our list -- we call our numerical order as TopResults

In [132]:
%%sql
SELECT 
    ROW_NUMBER() 
        OVER (
            ORDER BY completed DESC, 
                        price DESC
             ) TopResults,
    keyNew,
    ts,
    price,
    completed
FROM
    salesNew;

 * sqlite://
Done.

[(1, 'sale_5', '2019-11-08 02:00', 1.5, 1),
 (2, 'sale_6', '2019-11-08 02:00', 1.5, 1),
 (3, 'sale_3', '2019-11-08 01:00', 1.3, 1),
 (4, 'sale_1', '2019-11-08 00:00', 1.1, 1),
 (5, 'sale_4', '2019-11-08 01:00', 1.4, 0),
 (6, 'sale_2', '2019-11-08 01:00', 1.2, 0),
 (7, None, None, None, None)]

In [133]:
#45 -- Window Functions -- ROW_NUMBER() cont'd -- adding PARTITION BY -- we will now have fresh number sequences 
#for each defined partition

#Observe in our example there are 3 groups of timestamps that result (we also got rid of NULL row in our query)

In [134]:
%%sql
SELECT 
    ROW_NUMBER() 
        OVER (
            PARTITION BY ts
            ORDER BY completed DESC, 
                        price DESC
             ) TimeLists,
    keyNew,
    ts,
    price,
    completed
FROM
    salesNew
WHERE 
    keyNew IS NOT NULL;

 * sqlite://
Done.

[(1, 'sale_1', '2019-11-08 00:00', 1.1, 1),
 (1, 'sale_3', '2019-11-08 01:00', 1.3, 1),
 (2, 'sale_4', '2019-11-08 01:00', 1.4, 0),
 (3, 'sale_2', '2019-11-08 01:00', 1.2, 0),
 (1, 'sale_5', '2019-11-08 02:00', 1.5, 1),
 (2, 'sale_6', '2019-11-08 02:00', 1.5, 1)]

In [135]:
#46 -- Window Functions -- RANK() -- a numerical "rank" is assigned to each row based on whether its unique and what
#order it falls in when you specify you query

#notice how in our example, the completed entries (having completed = 1) are grouped into one cluster and ranked as #1,
#then because there are 4 entries with completed = 1, the next rank in our list is #5 (which is completed = 0)

In [136]:
%%sql
SELECT 
    RANK() 
        OVER (
            ORDER BY completed DESC
             ) RankCompleted,
    keyNew,
    ts,
    price,
    completed
FROM
    salesNew

 * sqlite://
Done.

[(1, 'sale_1', '2019-11-08 00:00', 1.1, 1),
 (1, 'sale_3', '2019-11-08 01:00', 1.3, 1),
 (1, 'sale_5', '2019-11-08 02:00', 1.5, 1),
 (1, 'sale_6', '2019-11-08 02:00', 1.5, 1),
 (5, 'sale_2', '2019-11-08 01:00', 1.2, 0),
 (5, 'sale_4', '2019-11-08 01:00', 1.4, 0),
 (7, None, None, None, None)]

In [137]:
#47 -- Window Functions -- RANK() cont'd -- Order it by price to get more ranks since there are more unique
#price entries

In [138]:
%%sql
SELECT 
    RANK() 
        OVER (
            ORDER BY price DESC
             ) RankPrice,
    keyNew,
    ts,
    price,
    completed
FROM
    salesNew

 * sqlite://
Done.

[(1, 'sale_5', '2019-11-08 02:00', 1.5, 1),
 (1, 'sale_6', '2019-11-08 02:00', 1.5, 1),
 (3, 'sale_4', '2019-11-08 01:00', 1.4, 0),
 (4, 'sale_3', '2019-11-08 01:00', 1.3, 1),
 (5, 'sale_2', '2019-11-08 01:00', 1.2, 0),
 (6, 'sale_1', '2019-11-08 00:00', 1.1, 1),
 (7, None, None, None, None)]

In [139]:
#48 -- Window Functions -- RANK() cont'd -- insert PARTITION BY into it as well

#here we partition our ranks by the completed status of each row

In [140]:
%%sql
SELECT 
    RANK() 
        OVER (
            PARTITION BY completed 
           ORDER BY price DESC
             ) RankPriceCompleted,
    keyNew,
    ts,
    price,
    completed 
FROM
    salesNew

 * sqlite://
Done.

[(1, None, None, None, None),
 (1, 'sale_4', '2019-11-08 01:00', 1.4, 0),
 (2, 'sale_2', '2019-11-08 01:00', 1.2, 0),
 (1, 'sale_5', '2019-11-08 02:00', 1.5, 1),
 (1, 'sale_6', '2019-11-08 02:00', 1.5, 1),
 (3, 'sale_3', '2019-11-08 01:00', 1.3, 1),
 (4, 'sale_1', '2019-11-08 00:00', 1.1, 1)]

In [141]:
#49 -- DISTINCT clause -- an attachment to SELECT command that is useful for removal of duplicates

#in our example, lets see how many different timestamps in salesNew table, but not NULL values (those are irrelavent)

In [142]:
%%sql
SELECT DISTINCT 
    ts
FROM 
    salesNew
WHERE 
    ts IS NOT NULL;

 * sqlite://
Done.

[('2019-11-08 00:00',), ('2019-11-08 01:00',), ('2019-11-08 02:00',)]

In [143]:
#49 -- DISTINCT clause cont'd -- let's include more columns in our query 

#the result shows one row missing (with price 1.5), but the rest were not total duplicates considering the multiple
#columns, so they are showing even though within individual columns there are some duplicate entries

In [144]:
%%sql
SELECT DISTINCT 
    ts,
    price,
    product,
    completed
FROM 
    salesNew;

 * sqlite://
Done.

[('2019-11-08 00:00', 1.1, 0, 1),
 ('2019-11-08 01:00', 1.2, 0, 0),
 ('2019-11-08 01:00', 1.3, 0, 1),
 ('2019-11-08 01:00', 1.4, 1, 0),
 ('2019-11-08 02:00', 1.5, 1, 1),
 (None, None, None, None)]

In [145]:
%%sql 
SELECT DISTINCT 
    ts,
    product
FROM salesNew
WHERE
ts IS NOT NULL;

 * sqlite://
Done.

[('2019-11-08 00:00', 0),
 ('2019-11-08 01:00', 0),
 ('2019-11-08 01:00', 1),
 ('2019-11-08 02:00', 1)]

In [146]:
#50 -- EXISTS operator -- return a result based on the existence of specified contents

#in our example we are returning set of results where entries in the first column of salesNew are equal to the entries
# of the first column of soldRecords (if such matches exist)

In [147]:
%%sql
SELECT 
    keyNew, 
    completed, 
    product, 
    price
FROM 
    salesNew sn
WHERE
     EXISTS (
        SELECT
            1
        FROM 
            soldRecords
        WHERE
            keyNewRecords = sn.keyNew
    )
ORDER BY keyNew;

 * sqlite://
Done.

[('sale_1', 1, 0, 1.1), ('sale_3', 1, 0, 1.3), ('sale_5', 1, 1, 1.5)]

In [148]:
#51 -- NOT EXISTS operator -- return a result based on the non-existence of specified contents

#in our example we are returning set of results where entries in the first column of salesNew are not equal to the 
# entries of the first column of soldRecords (if such matches exist)

In [149]:
%%sql
SELECT 
    keyNew, 
    completed, 
    product, 
    price
FROM 
    salesNew sn
WHERE
     NOT EXISTS (
        SELECT
            1
        FROM 
            soldRecords
        WHERE
            keyNewRecords = sn.keyNew
    )
ORDER BY keyNew;

 * sqlite://
Done.

[(None, None, None, None),
 ('sale_2', 0, 0, 1.2),
 ('sale_4', 0, 1, 1.4),
 ('sale_6', 1, 1, 1.5)]

In [150]:
#52 -- EXISTS operator cont'd -- example where our search doesn't match anything

#observe that the below query returns empty search result, because the search doesn't exist

In [151]:
%%sql
SELECT 
    keyNew, 
    completed, 
    product, 
    price
FROM 
    salesNew sn
WHERE
    EXISTS (
        SELECT
            1
        FROM 
            soldRecords
        WHERE
            keyNewRecords = "entry that isn't there"
    )
ORDER BY keyNew;

 * sqlite://
Done.

[]

In [152]:
%%sql
SELECT * FROM soldRecords;

 * sqlite://
Done.

[('sale_1', 11),
 ('sale_22', 22),
 ('sale_3', 33),
 ('sale_44', 44),
 ('sale_5', 55),
 ('sale_66', 66)]

In [153]:
#53 -- difference between JOIN and EXISTS -- 
# The main difference is that JOIN actually returns data
# while EXISTS simply checks for it's existence (and can stop searching when found)
# the results are the same, but with EXISTS we can 
# get away with using less resources

In [154]:
%%sql
SELECT 
    keyNew, 
    completed, 
    product, 
    price 
FROM 
    salesNew sn
INNER JOIN soldRecords sr
    ON sn.keyNew = sr.keyNewRecords;

 * sqlite://
Done.

[('sale_1', 1, 0, 1.1), ('sale_3', 1, 0, 1.3), ('sale_5', 1, 1, 1.5)]

In [155]:
%%sql
SELECT 
    keyNew, 
    completed, 
    product, 
    price
FROM 
    salesNew sn
WHERE
     EXISTS (
        SELECT
            1
        FROM 
            soldRecords
        WHERE
            keyNewRecords = sn.keyNew
    )
ORDER BY keyNew;

 * sqlite://
Done.

[('sale_1', 1, 0, 1.1), ('sale_3', 1, 0, 1.3), ('sale_5', 1, 1, 1.5)]

### ------------------------------------------------------
### ------------------------------------------------------
### ------------------------------------------------------
### 
## How to Install MySQL on Mac

#### STEP 1 - install mysql-connector
```pip install mysql-connector-python```

#### STEP 2 - try this code (fill in correct host, ...)
```python
import mysql.connector as connection
import pandas as pd
    
try:
    dbh = connection.connect(
        host="localhost", 
        database='nameDB',
        user="root", 
        passwd="yourpasswd",
        use_pure=True)
    sql = "Select * from test;"
    df = pd.read_sql(sql, dbh)
    dbh.close() #close the connection
except Exception as e:
    dbh.close()
    print(str(e))
```

Additional info: 
<br>You can also try to download a GUI to work with MySQL.
<br>There are many to choose from, for example:
- https://dev.mysql.com/downloads/workbench/
- https://dev.to/dailydevtips1/top-5-mysql-clients-for-mac-3j0p
- https://www.quora.com/What-is-the-best-SQL-query-tool-for-a-Mac
- etc.

## How to Install PostgreSQL on Mac

#### STEP 1 - install psycopg2 library
```pip install psycopg2```
#### STEP 2 - download Postgres App from https://postgresapp.com/ 
Install, click initialize to create a new server

#### STEP 3 - Configure your $PATH
Run the following code in terminal:
```sudo mkdir -p /etc/paths.d && echo /Applications/Postgres.app/Contents/Versions/latest/bin | sudo tee /etc/paths.d/postgresapp```

## How to Install Microsoft SQL Server on Mac

#### STEP 1 - download and install Docker Desktop for Mac
https://hub.docker.com/editions/community/docker-ce-desktop-mac?tab=description
<br>Launch Docker

#### STEP 2 - download SQL SERVER - run in terminal:
```sudo docker pull mcr.microsoft.com/mssql/server:2019-latest```

Note: if you downloaded a different Docker image, you can replace 
<br><b>mcr.microsoft.com/mssql/server:2019-latest</b>
<br>with the one you downloaded.

#### STEP 3 - Launch Docker Image - run in terminal:
```#docker run -d --name sql_server_demo -e 'ACCEPT_EULA=Y' -e 'SA_PASSWORD=reallyStrongPwd123' -p 1433:1433 mcr.microsoft.com/mssql/server:2019-latest ```

Note: in command above use your own name and password.

Note: if you downloaded a different Docker image, you can replace 
<br><b>mcr.microsoft.com/mssql/server:2019-latest</b>
<br>with the one you downloaded.

#### STEP 4 - run command to install the sql-cli command line tool:
```sudo npm install -g sql-cli```

#### STEP 5 - from terminal connect to SQL server using command:
```mssql -u myuser -p myuser```

#### STEP 6 - run a quick test - see what version of SQL Server you're running:
```select @@version```

Once you have MS SQL Server running locally, 
you can load sample database, for example
AdventureWorks sample databases:
  https://docs.microsoft.com/en-us/sql/samples/adventureworks-install-configure?view=sql-server-ver15&tabs=ssms